SET NAMES utf8mb4;

CREATE TABLE IF NOT EXISTS `asda2bbquestrecord` (
  `QuestName` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `Id` int NOT NULL,
  `StartLevel` int NOT NULL,
  `EndLevel` int NOT NULL,
  `Exp` int NOT NULL,
  `Gold` int NOT NULL,
  `Monster1Id` int NOT NULL,
  `Monster1Amount` int NOT NULL,
  `Monster2Id` int NOT NULL,
  `Monster2Amount` int NOT NULL,
  `Monster3Id` int NOT NULL,
  `Monster3Amount` int NOT NULL,
  `Monster4Id` int NOT NULL,
  `Monster4Amount` int NOT NULL,
  `Monster5Id` int NOT NULL,
  `Monster5Amount` int NOT NULL,
  `Item1Id` int NOT NULL,
  `Item1Amount` int NOT NULL,
  `Item2Id` int NOT NULL,
  `Item2Amount` int NOT NULL,
  `Item3Id` int NOT NULL,
  `Item3Amount` int NOT NULL,
  `Item4Id` int NOT NULL,
  `Item4Amount` int NOT NULL,
  `Item5Id` int NOT NULL,
  `Item5Amount` int NOT NULL,
  `RepeatCount` int NOT NULL,
  `Reward1Id` int NOT NULL,
  `Reward1Amount` int NOT NULL,
  `Reward2Id` int NOT NULL,
  `Reward2Amount` int NOT NULL,
  `Item1ReqAmount` int NOT NULL,
  `Item2ReqAmount` int NOT NULL,
  `Item3ReqAmount` int NOT NULL,
  `Item4ReqAmount` int NOT NULL,
  `Item5ReqAmount` int NOT NULL,
  PRIMARY KEY (`Id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;


INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('جلد الذئب', 20000, 12, 15, 1000, 1000, 20, 7, 19, 7, -1, 0, -1, 0, -1, 0, 21079, 0, 21196, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 7, 7, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مظلة وحش المظلة', 20001, 13, 16, 1000, 1000, 22, 15, -1, 0, -1, 0, -1, 0, -1, 0, 21080, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('زهور نيهيل', 20002, 14, 17, 900, 1000, 25, 15, 24, 0, 26, 0, -1, 0, -1, 0, 20793, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('حراس مختبر الوحوش', 20003, 15, 18, 900, 1000, 27, 15, -1, 0, -1, 0, -1, 0, -1, 0, 20794, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('معدات سلطعون الشق', 20004, 16, 19, 1300, 1300, 32, 15, -1, 0, -1, 0, -1, 0, -1, 0, 21043, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الحد من بط مفتاح التل', 20005, 17, 20, 1200, 1300, 34, 15, -1, 0, -1, 0, -1, 0, -1, 0, 21044, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('لحم سلطعون الحقل', 20006, 18, 21, 1400, 1300, 35, 16, -1, 0, -1, 0, -1, 0, -1, 0, 20814, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 16, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الجوز الذهبي', 20007, 19, 22, 1400, 1300, 36, 15, -1, 0, -1, 0, -1, 0, -1, 0, 21084, 0, -1, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('سحاب اللسان المحلي', 20008, 20, 23, 1700, 1500, 585, 6, 586, 6, 584, 6, -1, 0, -1, 0, 21045, 0, 21046, 0, 21047, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 6, 6, 6, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مخالب سلطعون تيك توك', 20009, 21, 24, 2400, 1500, 40, 9, 42, 9, -1, 0, -1, 0, -1, 0, 21048, 0, 21131, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 9, 9, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('جلد احمر وابيض', 20010, 22, 25, 1900, 1500, 41, 10, 43, 10, -1, 0, -1, 0, -1, 0, 21085, 0, 21086, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 10, 10, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('في حاجة الى جندي', 20011, 23, 26, 1700, 1500, 44, 15, 45, 5, -1, 0, -1, 0, -1, 0, 21049, 0, 21132, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 5, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('حذاء ذو 3 الوان', 20012, 24, 27, 2300, 1500, 45, 7, 46, 7, 47, 7, -1, 0, -1, 0, 21087, 0, 21088, 0, 21089, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 7, 7, 7, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مفاتيح الربط', 20013, 25, 28, 2400, 1500, 48, 15, 49, 8, -1, 0, -1, 0, -1, 0, 21050, 0, 21133, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 15, 8, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('هزيمة الضفدع ذو الشفرة', 20014, 26, 29, 2200, 1500, 50, 12, 51, 12, -1, 0, -1, 0, -1, 0, 21166, 0, 21134, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 12, 12, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('هزيمة فطر الحوض السام', 20015, 27, 30, 2400, 1500, 53, 8, 54, 8, 55, 8, -1, 0, -1, 0, 21051, 0, 21135, 0, 21175, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 8, 8, 8, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('اصطياد نمر الرقعة', 20016, 28, 31, 2300, 1500, 56, 16, 57, 8, -1, 0, -1, 0, -1, 0, 21123, 0, 21092, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 16, 8, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مواد طعم', 20017, 29, 32, 3000, 1500, 59, 13, 60, 13, -1, 0, -1, 0, -1, 0, 21068, 0, 21136, 0, -1, 0, -1, 0, -1, 0, 10, -1, 0, -1, 0, 13, 13, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('التفاخر', 20018, 30, 31, 6500, 4000, 76, 15, 65, 15, 588, 15, 591, 15, 592, 15, 39769, 0, 39576, 0, 39673, 0, 39861, 0, 39953, 0, 2, -1, 0, -1, 0, 15, 15, 15, 15, 15);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مخاطر الليل', 20019, 30, 32, 6500, 4000, 591, 15, 589, 15, 590, 15, 66, 15, 588, 15, 39579, 0, 39674, 0, 39862, 0, 39770, 0, 39577, 0, 2, 31856, 1, -1, 0, 15, 15, 15, 15, 15);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مضاعفة الأمن', 20020, 31, 33, 7000, 6000, 592, 16, 76, 16, 67, 16, 590, 16, 71, 16, 39771, 0, 39578, 0, 39675, 0, 39863, 0, 39955, 0, 1, -1, 0, -1, 0, 16, 16, 16, 16, 16);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('حقا؟', 20021, 32, 34, 11000, 6000, 593, 18, 591, 18, 69, 18, 71, 18, 67, 18, 39579, 0, 39676, 0, 39864, 0, 39863, 0, 39956, 0, 2, -1, 0, -1, 0, 18, 18, 18, 18, 18);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('اضرار', 20022, 33, 35, 12000, 6000, 68, 18, 72, 18, 71, 18, 70, 18, 79, 18, 39580, 0, 39865, 0, 39773, 0, 39677, 0, 39957, 0, 2, -1, 0, -1, 0, 18, 18, 18, 18, 18);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الاعداد للاعمال', 20023, 34, 35, 13700, 10000, 73, 25, 68, 25, 70, 25, 77, 25, 74, 25, 39581, 0, 39774, 0, 39678, 0, 39958, 0, 39866, 0, 2, -1, 0, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ساعدنا', 20024, 35, 35, 16000, 10000, 78, 20, 74, 20, 77, 20, 79, 20, 75, 20, 39774, 0, 39582, 0, 39775, 0, 39959, 0, 39679, 0, 2, 31851, 1, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('كيمياء قديمة', 20025, 36, 36, 7500, 7000, 594, 20, 86, 20, 82, 20, 80, 20, 84, 20, 39960, 0, 39868, 0, 39680, 0, 39583, 0, 39776, 0, 2, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مصممة الازياء', 20026, 36, 37, 10000, 7000, 86, 20, 83, 20, 85, 20, 81, 20, 80, 20, 39961, 0, 39777, 0, 39869, 0, 39681, 0, 39584, 0, 2, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ذوق رائع', 20027, 36, 38, 11000, 7000, 88, 20, 89, 20, 87, 20, 84, 20, 82, 20, 39870, 0, 39962, 0, 39778, 0, 39585, 0, 39682, 0, 2, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('انتقام غاضب', 20028, 37, 39, 20000, 7000, 596, 20, 90, 20, 86, 20, 83, 20, 87, 20, 39963, 0, 39871, 0, 39683, 0, 39586, 0, 39779, 0, 2, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('امدادات التخصص', 20029, 41, 41, 30000, 9000, 94, 22, 93, 22, 102, 22, 97, 22, 99, 22, 39687, 0, 39590, 0, 39967, 0, 39783, 0, 39875, 0, 2, 31857, 1, -1, 0, 22, 22, 22, 22, 22);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('اختيار ممتاز', 20030, 41, 42, 30000, 12000, 96, 22, 94, 22, 104, 22, 98, 22, 101, 22, 39591, 0, 39688, 0, 39968, 0, 39784, 0, 39876, 0, 1, 31852, 1, -1, 0, 22, 22, 22, 22, 22);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مستلزمات الجمال', 20031, 42, 43, 30000, 10000, 98, 23, 102, 23, 107, 23, 109, 23, 110, 23, 39592, 0, 39689, 0, 39785, 0, 39877, 0, 39969, 0, 2, -1, 0, -1, 0, 23, 23, 23, 23, 23);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('زيادة سكانية', 20032, 43, 44, 30000, 8000, 101, 23, 103, 23, 106, 23, 110, 23, 104, 23, 39593, 0, 39690, 0, 39878, 0, 39970, 0, 39786, 0, 3, -1, 0, -1, 0, 23, 23, 23, 23, 23);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('طموح الاطفال', 20033, 44, 45, 30000, 14000, 106, 24, 101, 24, 99, 24, 102, 24, 113, 24, 39879, 0, 39691, 0, 39594, 0, 39787, 0, 39971, 0, 2, -1, 0, -1, 0, 24, 24, 24, 24, 24);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('مصممة الازياء2', 20034, 45, 45, 32000, 12000, 107, 24, 97, 24, 110, 24, 112, 24, 113, 24, 39692, 0, 39595, 0, 39788, 0, 39880, 0, 39972, 0, 3, -1, 0, -1, 0, 24, 24, 24, 24, 24);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('وليمة جيدة', 20035, 41, 41, 30000, 9000, 130, 17, 133, 21, 129, 21, 135, 21, 137, 21, 39693, 0, 39789, 0, 39596, 0, 39881, 0, 39973, 0, 2, -1, 0, -1, 0, 17, 21, 21, 21, 21);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ما قبل الاختبار', 20036, 41, 42, 30000, 12000, 136, 21, 132, 21, 130, 21, 134, 21, 138, 21, 39597, 0, 39694, 0, 39882, 0, 39790, 0, 39974, 0, 1, -1, 0, -1, 0, 21, 21, 21, 21, 21);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('تنظيف المهملات', 20037, 42, 43, 30000, 8500, 129, 21, 139, 21, 131, 21, 134, 21, 137, 21, 39598, 0, 39975, 0, 39695, 0, 39791, 0, 39883, 0, 3, -1, 0, -1, 0, 21, 21, 21, 21, 21);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('فريق العمل القاسي', 20038, 43, 44, 30000, 9000, 140, 25, 131, 25, 135, 25, 142, 25, 145, 25, 39792, 0, 39599, 0, 39696, 0, 39884, 0, 39976, 0, 2, 31852, 1, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ازياء الحفلة', 20039, 44, 45, 30000, 14000, 132, 24, 139, 24, 140, 24, 135, 24, 143, 24, 39600, 0, 39793, 0, 39885, 0, 39697, 0, 39977, 0, 2, 31857, 1, -1, 0, 24, 24, 24, 24, 24);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('القائد', 20040, 45, 45, 32000, 13500, 144, 23, 130, 23, 134, 23, 138, 23, 137, 23, 39601, 0, 39978, 0, 39698, 0, 39886, 0, 39794, 0, 3, -1, 0, -1, 0, 23, 23, 23, 23, 23);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('سهام السم', 20041, 46, 46, 35000, 11000, 115, 25, 118, 25, 117, 25, 116, 25, 119, 25, 39602, 0, 39887, 0, 39795, 0, 39699, 0, 39979, 0, 3, -1, 0, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('رحلة التخرج', 20042, 46, 47, 35000, 10000, 121, 25, 120, 25, 124, 25, 122, 25, 601, 25, 39700, 0, 39796, 0, 39980, 0, 39888, 0, 39603, 0, 2, -1, 0, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الشركة', 20043, 46, 48, 35000, 10000, 125, 26, 123, 26, 127, 26, 119, 26, 115, 26, 39797, 0, 39889, 0, 39981, 0, 39701, 0, 39604, 0, 1, -1, 0, -1, 0, 26, 26, 26, 26, 26);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('هواية فريدة', 20044, 47, 49, 40000, 10000, 123, 26, 128, 26, 126, 26, 117, 26, 118, 26, 39798, 0, 39982, 0, 39890, 0, 39605, 0, 39702, 0, 2, -1, 0, -1, 0, 26, 26, 26, 26, 26);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('انقذ الغابة', 20045, 48, 49, 50000, 10000, 120, 27, 125, 27, 122, 27, 126, 27, 119, 27, 39703, 0, 39891, 0, 39799, 0, 39983, 0, 39606, 0, 3, -1, 0, -1, 0, 27, 27, 27, 27, 27);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('رحلة امنة', 20046, 49, 49, 65000, 10000, 122, 27, 121, 27, 124, 27, 128, 27, 127, 27, 39704, 0, 39607, 0, 39800, 0, 39984, 0, 39892, 0, 3, -1, 0, -1, 0, 27, 27, 27, 27, 27);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('اعمال خيرية', 20047, 46, 46, 30000, 11000, -1, 0, 146, 27, 148, 27, 150, 27, 152, 27, 39985, 0, 39608, 0, 39705, 0, 39801, 0, 39893, 0, 2, -1, 0, -1, 0, 0, 27, 27, 27, 27);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ياله من اذلال', 20048, 46, 47, 30000, 10000, 150, 25, 147, 25, 153, 25, 155, 25, 151, 25, 39609, 0, 39706, 0, 39894, 0, 39986, 0, 39802, 0, 2, -1, 0, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('ابادة البط', 20049, 47, 48, 30000, 10000, 147, 25, 156, 25, 160, 25, 152, 25, 158, 25, 39610, 0, 39803, 0, 39987, 0, 39707, 0, 39895, 0, 2, -1, 0, -1, 0, 25, 25, 25, 25, 25);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('جيش الوحوش؟', 20050, 47, 49, 30000, 10000, 156, 26, 161, 26, 157, 26, 152, 26, 159, 26, 39708, 0, 39988, 0, 39804, 0, 39611, 0, 39896, 0, 2, -1, 0, -1, 0, 26, 26, 26, 26, 26);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('تنظيف البقايا', 20051, 48, 49, 30000, 10000, 153, 26, 146, 26, 156, 26, 159, 26, 158, 26, 39612, 0, 39709, 0, 39805, 0, 39989, 0, 39896, 0, 3, 31852, 1, -1, 0, 26, 26, 26, 26, 26);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('لا تسال', 20052, 49, 49, 32000, 10000, 146, 26, 155, 26, 161, 26, 157, 26, 160, 26, 39613, 0, 39710, 0, 39990, 0, 39806, 0, 39898, 0, 3, 31857, 1, -1, 0, 26, 26, 26, 26, 26);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('المقهورين', 20061, 38, 40, 30000, 8000, 597, 20, 596, 20, 89, 20, 86, 20, 81, 20, 39964, 0, 39872, 0, 39780, 0, 39684, 0, 39587, 0, 3, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('المعتقدات', 20062, 39, 40, 30000, 13000, 91, 20, 88, 20, 598, 20, 594, 20, 595, 20, 39873, 0, 39685, 0, 39965, 0, 39588, 0, 39781, 0, 3, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الطبخ النباتي', 20063, 40, 40, 30000, 14000, 89, 20, 597, 20, 90, 20, 83, 20, 594, 20, 39966, 0, 39782, 0, 39874, 0, 39686, 0, 39589, 0, 3, -1, 0, -1, 0, 20, 20, 20, 20, 20);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('الانسجة السوداء', 20064, 20, 24, 9180, 4000, 47, 15, 37, 15, 42, 15, -1, 0, -1, 0, 21184, 0, 21121, 0, 21165, 0, -1, 0, -1, 0, 2, -1, 0, -1, 0, 15, 15, 15, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('خبرة ارض المعركة', 20066, 28, 30, 16200, 7500, 58, 25, 59, 25, 56, 25, -1, 0, -1, 0, 21167, 0, 21124, 0, 21123, 0, -1, 0, -1, 0, 2, -1, 0, -1, 0, 25, 25, 25, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('خطوة للانتقام', 20110, 36, 40, 12000, 1000, 637, 50, -1, 0, -1, 0, -1, 0, -1, 0, 21199, 0, -1, 0, -1, 0, -1, 0, -1, 0, 1, 33654, 1, -1, 0, 50, 0, 0, 0, 0);
INSERT IGNORE INTO `asda2bbquestrecord` VALUES ('[فريق]فيلق ديكرون المنتعش', 20112, 48, 50, 232000, 1000, 638, 70, 643, 1, 633, 1, -1, 0, -1, 0, 21200, 0, 21204, 0, 21208, 0, -1, 0, -1, 0, 1, 33654, 3, -1, 0, 70, 1, 1, 0, 0);
